/*
Статическое и динамическое выделение памяти


утечка памяти, стек и куча

*/

/*

Статическая память - стек
При вызове программы, она выделяет себе память под все её объявленные элементы
Программа заранее знает, сколько места в памяти будут занимать элементы, пример массив


Динамическая память -

Если нужно запросить еще памяти для работы, то это называется динамическое выделение

ситуация:

Если я считываю данные из базы данных, так как данные могут поменяться

Если выделил динамическую память, то нужно в конце почистить её



*/

#include <iostream>
using namespace std;
		  

void main()
{
	setlocale(LC_ALL, "rus");
	
	

}

