/*
С++ поддерживает широкий диапазон функций для манипуляций
со строками. 
Самые известные из них:

strcpy(куда, откуда)
копирует содержимое строки откуда в строку куда.
Массив образующий куда, должен иметь достаточный размер, чтобы  него
поместилась строка откда.


strcat()
strcmp()
strlen()

Все строковые функции используют один и тот же заголовок
<cstring>. 




*/

/*
 Пример обработки строк

 в приведенной программе ниже используются четрые функии обработки
*/

